ac_circuits.org
#+TITLE: Basic AC Electrical Circuits
#+AUTHOR: Rahul Martim Juliato
#+OPTIONS: toc:nil timestamp:nil date:nil


#+BEGIN_SRC

Valid Inputs are in the form of:

(Modulus ; Angle)
(Real   , Imaginary)

C-c C-c over the # formula bellow the table evals this table only
C-u C-c C-c evals the entire file

#+END_SRC

* Basic Circuit     - R
#+BEGIN_SRC
 +---------------VVVVV-----+
 |                 R       |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
#+END_SRC

| Ut | (220; 0) |        | Volt   |
| R  |  (120,0) |        | Ohm    |
| f  |      300 |        | Hertz  |
|----+----------+--------+--------|
| it |   1.83e0 | 1.83e0 | Ampère |
#+TBLFM: @4$2=@1$2/@2$2;e3::@4$3=polar(@4$2);e3

* Basic Circuit     - L
#+BEGIN_SRC
 +----------------OOOOO----+
 |                  L      |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
#+END_SRC

| Ut | (500; 0)       |                 | Volt   |
| L  | 200e-3         |                 | Henry  |
| f  | 300            |                 | Hertz  |
|----+----------------+-----------------+--------|
| Xl | (0e0, 377e0)   | (377e0; 90e0)   | Ohm    |
| it | (0e0, -1.33e0) | (1.33e0; -90e0) | Ampère |
#+TBLFM: @4$2=(0,1)*2*3.14159265358979*@2$2*@3$2;Ne3::@4$3=polar(@4$2);e3::@5$2=@1$2/@4$2;e3::@5$3=polar(@5$2);e3

* Basic Circuit     - C
#+BEGIN_SRC          
 +-----------------|  |----+
 |                  C      |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
#+END_SRC

| Ut | (30; 0)        |                 | Volt   |
| C  | 1200e-6        |                 | Farad  |
| f  | 30             |                 | Hertz  |
|----+----------------+-----------------+--------|
| Xc | (0e0, -4.42e0) | (4.42e0; -90e0) | Ohm    |
| it | (0e0, 6.79e0)  | (6.79e0; 90e0)  | Ampère |
#+TBLFM: @4$2=(0,-1)*1/(2*3.14159265358979*@2$2*@3$2);Ne3::@4$3=polar(@4$2);e3::@5$2=@1$2/@4$2;e3::@5$3=polar(@5$2);e3

* Series Circuit    - RL
#+BEGIN_SRC
 +------VVVVV-----OOOOO----+
 |        R         L      |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
#+END_SRC

| Ut | (500; 0)          |                   | Volt   |
| R  | (55,0)            |                   | Ohm    |
| L  | 28e-3             |                   | Henry  |
| f  | 300               |                   | Hertz  |
|----+-------------------+-------------------+--------|
| Xl | (0e0, 52.8e0)     | (52.8e0; 90e0)    | Ohm    |
| Z  | (55e0, 52.8e0)    | (76.2e0; 43.8e0)  | Ohm    |
| it | (4.73e0, -4.54e0) | (6.56e0; -43.8e0) | Ampère |
| Ur | (260e0, -250e0)   | (361e0; -43.9e0)  | Volt   |
| Ul | (240e0, 250e0)    | (347e0; 46.2e0)   | Volt   |
#+TBLFM: @5$2=(0,1)*2*3.14159265358979*@3$2*@4$2;Ne3::@5$3=polar(@5$2);e3::@6$2=@5$2+@2$2;e3::@6$3=polar(@6$2);e3::@7$2=@1$2/@6$2;e3::@7$3=polar(@7$2);e3::@8$2=@7$2*@2$2;e3::@8$3=polar(@8$2);e3::@9$2=@7$2*@5$2;e3::@9$3=polar(@9$2);e3

* Series Circuit    - RC
#+BEGIN_SRC          
 +------VVVVV------|  |----+
 |        R         C      |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
#+END_SRC

| Ut | (20; 0)           |                   | Volt   |
| R  | (10,0)            |                   | Ohm    |
| C  | 1200e-6           |                   | Farad  |
| f  | 25                |                   | Hertz  |
|----+-------------------+-------------------+--------|
| Xc | (0e0, -5.31e0)    | (5.31e0; -90e0)   | Ohm    |
| Z  | (10e0, -5.31e0)   | (11.3e0; -28.0e0) | Ohm    |
| it | (1.56e0, 828e-3)  | (1.77e0; 28.0e0)  | Ampère |
| Ur | (15.6e0, 8.28e0)  | (17.7e0; 28.0e0)  | Volt   |
| Uc | (4.40e0, -8.28e0) | (9.38e0; -62.0e0) | Volt   |
#+TBLFM: @5$2=(0,-1)*1/(2*3.14159265358979*@3$2*@4$2);Ne3::@5$3=polar(@5$2);e3::@6$2=@5$2+@2$2;e3::@6$3=polar(@6$2);e3::@7$2=@1$2/@6$2;e3::@7$3=polar(@7$2);e3::@8$2=@7$2*@2$2;e3::@8$3=polar(@8$2);e3::@9$2=@7$2*@5$2;e3::@9$3=polar(@9$2);e3

* Series Circuit    - RLC
#+BEGIN_SRC          
 +------VVVVV---OOOOO---|  |----+
 |        R       L      C      |
 |                              |
(~)Ut                           |
 |                              |
 |                              |
 +------------------------------+
#+END_SRC

| Ut | (200; 0)           |                   | Volt   |
| R  | (10,0)             |                   | Ohm    |
| L  | 20e-3              |                   | Henry  |
| C  | 100e-6             |                   | Farad  |
| f  | 300                |                   | Hertz  |
|----+--------------------+-------------------+--------|
| Xl | (0e0, 37.7e0)      | (37.7e0; 90e0)    | Ohm    |
| Xc | (0e0, -5.31e0)     | (5.31e0; -90e0)   | Ohm    |
| Z  | (10e0, 32.4e0)     | (33.9e0; 72.8e0)  | Ohm    |
| it | (1.74e0, -5.64e0)  | (5.90e0; -72.9e0) | Ampère |
| Ur | (17.4e0, -56.4e0)  | (59.0e0; -72.9e0) | Volt   |
| Ul | (213e0, 65.6e0)    | (223e0; 17.1e0)   | Volt   |
| Uc | (-29.9e0, -9.24e0) | (31.3e0; -163e0)  | Volt   |
#+TBLFM: @6$2=(0, 1)*2*3.14159265358979*@3$2*@5$2;Ne3::@6$3=polar(@6$2);e3::@7$2=(0,-1)*1/(2*3.14159265358979*@4$2*@5$2);Ne3::@7$3=polar(@7$2);e3::@8$2=@6$2+@7$2+@2$2;e3::@8$3=polar(@8$2);e3::@9$2=@1$2/@8$2;e3::@9$3=polar(@9$2);e3::@10$2=@9$2*@2$2;e3::@10$3=polar(@10$2);e3::@11$2=@9$2*@6$2;e3::@11$3=polar(@11$2);e3::@12$2=@9$2*@7$2;e3::@12$3=polar(@12$2);e3

* Parallel Circuit  - RL 
#+BEGIN_SRC
          L
 +------OOOOO----+         
 |               |
 +------VVVVV----+
 |        R      |
 |               |
(~)Ut            |
 |               |
 |               |
 +---------------+
#+END_SRC

| Ut | (20; 0)           |                   | Volt   |
| R  | (10,0)            |                   | Ohm    |
| L  | 20e-3             |                   | Henry  |
| f  | 15                |                   | Hertz  |
|----+-------------------+-------------------+--------|
| Xl | (0e0, 1.88e0)     | (1.88e0; 90e0)    | Ohm    |
| Z  | (341e-3, 1.82e0)  | (1.85e0; 79.4e0)  | Ohm    |
| it | (1.99e0, -10.6e0) | (10.8e0; -79.4e0) | Ampère |
| ir | 2                 | 2                 | Ampère |
| il | (0e0, -10.6e0)    | (10.6e0; -90e0)   | Ampère |
#+TBLFM: @5$2=(0,1)*2*3.14159265358979*@3$2*@4$2;Ne3::@5$3=polar(@5$2);e3::@6$2=1/(1/@5$2+1/@2$2);e3::@6$3=polar(@6$2);e3::@7$2=@1$2/@6$2;e3::@7$3=polar(@7$2);e3::@8$2=@1$2/@2$2;e3::@8$3=polar(@8$2);e3::@9$2=@1$2/@5$2;e3::@9$3=polar(@9$2);e3

* Parallel Circuit  - RC
#+BEGIN_SRC
           C
 +--------|  |-----+ 
 |                 |
 +------VVVVV------+
 |        R        |
 |                 |
(~)Ut              |
 |                 |
 |                 |
 +-----------------+
#+END_SRC

| Ut | (200; 0)          |                   | Volt   |
| R  | (10,0)            |                   | Ohm    |
| C  | 100e-6            |                   | Farad  |
| f  | 300               |                   | Hertz  |
|----+-------------------+-------------------+--------|
| Xc | (0e0, -5.31e0)    | (5.31e0; -90e0)   | Ohm    |
| Z  | (2.20e0, -4.14e0) | (4.69e0; -62.0e0) | Ohm    |
| it | (20.0e0, 37.7e0)  | (42.7e0; 62.1e0)  | Ampère |
| ir | 20                | 20                | Ampère |
| ic | (0e0, 37.7e0)     | (37.7e0; 90e0)    | Ampère |
#+TBLFM: @5$2=(0,-1)*1/(2*3.14159265358979*@3$2*@4$2);Ne3::@5$3=polar(@5$2);e3::@6$2=1/(1/@5$2+1/@2$2);e3::@6$3=polar(@6$2);e3::@7$2=@1$2/@6$2;e3::@7$3=polar(@7$2);e3::@8$2=@1$2/@2$2;e3::@8$3=polar(@8$2);e3::@9$2=@1$2/@5$2;e3::@9$3=polar(@9$2);e3

* Parallel Circuit  - RLC
#+BEGIN_SRC
       C
 +-------|  |----+
 |     L         |
 +------OOOOO----+         
 |               |
 +------VVVVV----+
 |     R         |
 |               |
(~)Ut            |
 |               |
 |               |
 +---------------+
#+END_SRC
         
| Ut | (200; 0)          |                   | Volt   |
| R  | (10,0)            |                   | Ohm    |
| L  | 20e-3             |                   | Henry  |
| C  | 1200e-6           |                   | Farad  |
| f  | 30                |                   | Hertz  |
|----+-------------------+-------------------+--------|
| Xl | (0e0, 3.77e0)     | (3.77e0; 90e0)    | Ohm    |
| Xc | (0e0, -4.42e0)    | (4.42e0; -90e0)   | Ohm    |
| Z  | (8.68e0, 3.39e0)  | (9.32e0; 21.3e0)  | Ohm    |
| it | (20.0e0, -7.81e0) | (21.5e0; -21.3e0) | Ampère |
| ir | 20                | 20                | Ampère |
| il | (0e0, -53.1e0)    | (53.1e0; -90e0)   | Ampère |
| ic | (0e0, 45.2e0)     | (45.2e0; 90e0)    | Ampère |
#+TBLFM: @6$2=(0, 1)*2*3.14159265358979*@3$2*@5$2;Ne3::@6$3=polar(@6$2);e3::@7$2=(0,-1)*1/(2*3.14159265358979*@4$2*@5$2);Ne3::@7$3=polar(@7$2);e3::@8$2=1/(1/@6$2+1/@7$2+1/@2$2);e3::@8$3=polar(@8$2);e3::@9$2=@1$2/@8$2;e3::@9$3=polar(@9$2);e3::@10$2=@1$2/@2$2;e3::@10$3=polar(@10$2);e3::@11$2=@1$2/@6$2;e3::@11$3=polar(@11$2);e3::@12$2=@1$2/@7$2;e3::@12$3=polar(@12$2);e3
