ac_circuits.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Basic AC Electrical Circuits</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rahul Martim Juliato" />
</head>
<body>
<div id="content">
<h1 class="title">Basic AC Electrical Circuits</h1>
<pre class="example">

Valid Inputs are in the form of:

(Modulus ; Angle)
(Real   , Imaginary)

# C-c C-c over the # formula bellow the table evals this table only
# C-u C-c C-c evals the entire file

</pre>

<div id="outline-container-orgc9f6d6c" class="outline-2">
<h2 id="orgc9f6d6c"><span class="section-number-2">1</span> Basic Circuit     - R</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
 +---------------VVVVV-----+
 |                 R       |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ut</th>
<th scope="col" class="org-right">(220; 0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Volt</th>
</tr>

<tr>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-right">(120,0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Ohm</th>
</tr>

<tr>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-right">300</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hertz</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">it</td>
<td class="org-right">1.83e0</td>
<td class="org-left">1.83e0</td>
<td class="org-left">Ampère</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7ef83d4" class="outline-2">
<h2 id="org7ef83d4"><span class="section-number-2">2</span> Basic Circuit     - L</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
 +----------------OOOOO----+
 |                  L      |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ut</th>
<th scope="col" class="org-left">(500; 0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Volt</th>
</tr>

<tr>
<th scope="col" class="org-left">L</th>
<th scope="col" class="org-left">200e-3</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Henry</th>
</tr>

<tr>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">300</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hertz</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Xl</td>
<td class="org-left">(0e0, 377e0)</td>
<td class="org-left">(377e0; 90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">it</td>
<td class="org-left">(0e0, -1.33e0)</td>
<td class="org-left">(1.33e0; -90e0)</td>
<td class="org-left">Ampère</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org03ae738" class="outline-2">
<h2 id="org03ae738"><span class="section-number-2">3</span> Basic Circuit     - C</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
 +-----------------|  |----+
 |                  C      |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ut</th>
<th scope="col" class="org-left">(30; 0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Volt</th>
</tr>

<tr>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">1200e-6</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Farad</th>
</tr>

<tr>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">30</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hertz</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Xc</td>
<td class="org-left">(0e0, -4.42e0)</td>
<td class="org-left">(4.42e0; -90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">it</td>
<td class="org-left">(0e0, 6.79e0)</td>
<td class="org-left">(6.79e0; 90e0)</td>
<td class="org-left">Ampère</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org06c8660" class="outline-2">
<h2 id="org06c8660"><span class="section-number-2">4</span> Series Circuit    - RL</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
 +------VVVVV-----OOOOO----+
 |        R         L      |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ut</th>
<th scope="col" class="org-left">(500; 0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Volt</th>
</tr>

<tr>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-left">(55,0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Ohm</th>
</tr>

<tr>
<th scope="col" class="org-left">L</th>
<th scope="col" class="org-left">28e-3</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Henry</th>
</tr>

<tr>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">300</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hertz</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Xl</td>
<td class="org-left">(0e0, 52.8e0)</td>
<td class="org-left">(52.8e0; 90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">Z</td>
<td class="org-left">(55e0, 52.8e0)</td>
<td class="org-left">(76.2e0; 43.8e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">it</td>
<td class="org-left">(4.73e0, -4.54e0)</td>
<td class="org-left">(6.56e0; -43.8e0)</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">Ur</td>
<td class="org-left">(260e0, -250e0)</td>
<td class="org-left">(361e0; -43.9e0)</td>
<td class="org-left">Volt</td>
</tr>

<tr>
<td class="org-left">Ul</td>
<td class="org-left">(240e0, 250e0)</td>
<td class="org-left">(347e0; 46.2e0)</td>
<td class="org-left">Volt</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org85a8db4" class="outline-2">
<h2 id="org85a8db4"><span class="section-number-2">5</span> Series Circuit    - RC</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
 +------VVVVV------|  |----+
 |        R         C      |
 |                         |
(~)Ut                      |
 |                         |
 |                         |
 +-------------------------+
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ut</th>
<th scope="col" class="org-left">(20; 0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Volt</th>
</tr>

<tr>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-left">(10,0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Ohm</th>
</tr>

<tr>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">1200e-6</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Farad</th>
</tr>

<tr>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">25</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hertz</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Xc</td>
<td class="org-left">(0e0, -5.31e0)</td>
<td class="org-left">(5.31e0; -90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">Z</td>
<td class="org-left">(10e0, -5.31e0)</td>
<td class="org-left">(11.3e0; -28.0e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">it</td>
<td class="org-left">(1.56e0, 828e-3)</td>
<td class="org-left">(1.77e0; 28.0e0)</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">Ur</td>
<td class="org-left">(15.6e0, 8.28e0)</td>
<td class="org-left">(17.7e0; 28.0e0)</td>
<td class="org-left">Volt</td>
</tr>

<tr>
<td class="org-left">Uc</td>
<td class="org-left">(4.40e0, -8.28e0)</td>
<td class="org-left">(9.38e0; -62.0e0)</td>
<td class="org-left">Volt</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5a22481" class="outline-2">
<h2 id="org5a22481"><span class="section-number-2">6</span> Series Circuit    - RLC</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
 +------VVVVV---OOOOO---|  |----+
 |        R       L      C      |
 |                              |
(~)Ut                           |
 |                              |
 |                              |
 +------------------------------+
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ut</th>
<th scope="col" class="org-left">(200; 0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Volt</th>
</tr>

<tr>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-left">(10,0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Ohm</th>
</tr>

<tr>
<th scope="col" class="org-left">L</th>
<th scope="col" class="org-left">20e-3</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Henry</th>
</tr>

<tr>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">100e-6</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Farad</th>
</tr>

<tr>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">300</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hertz</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Xl</td>
<td class="org-left">(0e0, 37.7e0)</td>
<td class="org-left">(37.7e0; 90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">Xc</td>
<td class="org-left">(0e0, -5.31e0)</td>
<td class="org-left">(5.31e0; -90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">Z</td>
<td class="org-left">(10e0, 32.4e0)</td>
<td class="org-left">(33.9e0; 72.8e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">it</td>
<td class="org-left">(1.74e0, -5.64e0)</td>
<td class="org-left">(5.90e0; -72.9e0)</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">Ur</td>
<td class="org-left">(17.4e0, -56.4e0)</td>
<td class="org-left">(59.0e0; -72.9e0)</td>
<td class="org-left">Volt</td>
</tr>

<tr>
<td class="org-left">Ul</td>
<td class="org-left">(213e0, 65.6e0)</td>
<td class="org-left">(223e0; 17.1e0)</td>
<td class="org-left">Volt</td>
</tr>

<tr>
<td class="org-left">Uc</td>
<td class="org-left">(-29.9e0, -9.24e0)</td>
<td class="org-left">(31.3e0; -163e0)</td>
<td class="org-left">Volt</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgdad0546" class="outline-2">
<h2 id="orgdad0546"><span class="section-number-2">7</span> Parallel Circuit  - RL</h2>
<div class="outline-text-2" id="text-7">
<pre class="example">
	  L
 +------OOOOO----+         
 |               |
 +------VVVVV----+
 |        R      |
 |               |
(~)Ut            |
 |               |
 |               |
 +---------------+
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ut</th>
<th scope="col" class="org-left">(20; 0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Volt</th>
</tr>

<tr>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-left">(10,0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Ohm</th>
</tr>

<tr>
<th scope="col" class="org-left">L</th>
<th scope="col" class="org-left">20e-3</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Henry</th>
</tr>

<tr>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">15</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hertz</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Xl</td>
<td class="org-left">(0e0, 1.88e0)</td>
<td class="org-left">(1.88e0; 90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">Z</td>
<td class="org-left">(341e-3, 1.82e0)</td>
<td class="org-left">(1.85e0; 79.4e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">it</td>
<td class="org-left">(1.99e0, -10.6e0)</td>
<td class="org-left">(10.8e0; -79.4e0)</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">ir</td>
<td class="org-left">2</td>
<td class="org-left">2</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">il</td>
<td class="org-left">(0e0, -10.6e0)</td>
<td class="org-left">(10.6e0; -90e0)</td>
<td class="org-left">Ampère</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0eb297d" class="outline-2">
<h2 id="org0eb297d"><span class="section-number-2">8</span> Parallel Circuit  - RC</h2>
<div class="outline-text-2" id="text-8">
<pre class="example">
	   C
 +--------|  |-----+ 
 |                 |
 +------VVVVV------+
 |        R        |
 |                 |
(~)Ut              |
 |                 |
 |                 |
 +-----------------+
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ut</th>
<th scope="col" class="org-left">(200; 0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Volt</th>
</tr>

<tr>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-left">(10,0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Ohm</th>
</tr>

<tr>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">100e-6</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Farad</th>
</tr>

<tr>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">300</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hertz</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Xc</td>
<td class="org-left">(0e0, -5.31e0)</td>
<td class="org-left">(5.31e0; -90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">Z</td>
<td class="org-left">(2.20e0, -4.14e0)</td>
<td class="org-left">(4.69e0; -62.0e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">it</td>
<td class="org-left">(20.0e0, 37.7e0)</td>
<td class="org-left">(42.7e0; 62.1e0)</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">ir</td>
<td class="org-left">20</td>
<td class="org-left">20</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">ic</td>
<td class="org-left">(0e0, 37.7e0)</td>
<td class="org-left">(37.7e0; 90e0)</td>
<td class="org-left">Ampère</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgef62513" class="outline-2">
<h2 id="orgef62513"><span class="section-number-2">9</span> Parallel Circuit  - RLC</h2>
<div class="outline-text-2" id="text-9">
<pre class="example">
       C
 +-------|  |----+
 |     L         |
 +------OOOOO----+         
 |               |
 +------VVVVV----+
 |     R         |
 |               |
(~)Ut            |
 |               |
 |               |
 +---------------+
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ut</th>
<th scope="col" class="org-left">(200; 0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Volt</th>
</tr>

<tr>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-left">(10,0)</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Ohm</th>
</tr>

<tr>
<th scope="col" class="org-left">L</th>
<th scope="col" class="org-left">20e-3</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Henry</th>
</tr>

<tr>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">1200e-6</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Farad</th>
</tr>

<tr>
<th scope="col" class="org-left">f</th>
<th scope="col" class="org-left">30</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hertz</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Xl</td>
<td class="org-left">(0e0, 3.77e0)</td>
<td class="org-left">(3.77e0; 90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">Xc</td>
<td class="org-left">(0e0, -4.42e0)</td>
<td class="org-left">(4.42e0; -90e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">Z</td>
<td class="org-left">(8.68e0, 3.39e0)</td>
<td class="org-left">(9.32e0; 21.3e0)</td>
<td class="org-left">Ohm</td>
</tr>

<tr>
<td class="org-left">it</td>
<td class="org-left">(20.0e0, -7.81e0)</td>
<td class="org-left">(21.5e0; -21.3e0)</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">ir</td>
<td class="org-left">20</td>
<td class="org-left">20</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">il</td>
<td class="org-left">(0e0, -53.1e0)</td>
<td class="org-left">(53.1e0; -90e0)</td>
<td class="org-left">Ampère</td>
</tr>

<tr>
<td class="org-left">ic</td>
<td class="org-left">(0e0, 45.2e0)</td>
<td class="org-left">(45.2e0; 90e0)</td>
<td class="org-left">Ampère</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rahul Martim Juliato</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
